CSI API ETABS v1

# cDesignSteelChinese_2018 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDStChinese_2018 Chinese_2018 { get; }

    ReadOnly Property Chinese_2018 As cDStChinese_2018
    	Get

    Dim instance As cDesignSteel
    Dim value As cDStChinese_2018

    value = instance.Chinese_2018

    property cDStChinese_2018^ Chinese_2018 {
    	cDStChinese_2018^ get ();
    }

    abstract Chinese_2018 : cDStChinese_2018 with get

#### Property Value

Type: cDStChinese_2018

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com